In [1]:
import pandas as pd

The standard way to create Timestamp objects is with the module-level function ``to_ datetime``, which takes a variety of argument types

In [2]:
pd.to_datetime('now')

Timestamp('2025-12-29 20:56:46.162401')

It’s far more common and useful to call ``pd.to_datetime`` on an existing series of strings containing date and time information.

In [5]:
s = pd.Series(['1970-07-14', '1972-03-01', '2000-12-16',
    '2002-12-17', '2005-10-31'])
s

0    1970-07-14
1    1972-03-01
2    2000-12-16
3    2002-12-17
4    2005-10-31
dtype: object

In [9]:
pd.to_datetime(s)

0   1970-07-14
1   1972-03-01
2   2000-12-16
3   2002-12-17
4   2005-10-31
dtype: datetime64[ns]

Don’t be confused by the indication that the ``dtype`` is ``datetime64``, a type from NumPy; the values are all of type ``Timestamp``, a pandas type.

In [13]:
s = pd.Series(['1970-Jul-14', '1972-Mar-01', '2000-Dec-16',
    '2002-Dec-17', '2005-Oct-31'])
s

0    1970-Jul-14
1    1972-Mar-01
2    2000-Dec-16
3    2002-Dec-17
4    2005-Oct-31
dtype: object

In [14]:
pd.to_datetime(s)

0   1970-07-14
1   1972-03-01
2   2000-12-16
3   2002-12-17
4   2005-10-31
dtype: datetime64[ns]

In [16]:
s = pd.Series(['14-07-1970', '01-03-1972', '16-12-2000',
    '17-12-2002', '31-10-2005'])
s

0    14-07-1970
1    01-03-1972
2    16-12-2000
3    17-12-2002
4    31-10-2005
dtype: object

In [19]:
pd.to_datetime(s, dayfirst=True)

0   1970-07-14
1   1972-03-01
2   2000-12-16
3   2002-12-17
4   2005-10-31
dtype: datetime64[ns]

In [ ]:
s = pd.Series(['01/03/1972', '05/12/1995']) # By default, ambiguous date formats are assumed to have the month first, as in the United Statess
pd.to_datetime(s)

0   1972-01-03
1   1995-05-12
dtype: datetime64[ns]

In [22]:
pd.to_datetime(s, dayfirst=True)

0   1972-03-01
1   1995-12-05
dtype: datetime64[ns]

In [26]:
s = pd.Series(['1970-07-14 8:00', '1972-03-01 10:00',
    '2000-12-16 12:15:28', '2002-12-17 18:17', '2005-10-31 23:51'])
s

0        1970-07-14 8:00
1       1972-03-01 10:00
2    2000-12-16 12:15:28
3       2002-12-17 18:17
4       2005-10-31 23:51
dtype: object

In [28]:
pd.to_datetime('1970-07-14 8:00')

Timestamp('1970-07-14 08:00:00')

In [29]:
pd.to_datetime('1972-03-01 10:00')

Timestamp('1972-03-01 10:00:00')

In [30]:
pd.to_datetime('2000-12-16 12:15:28')

Timestamp('2000-12-16 12:15:28')

In [31]:
pd.to_datetime('2002-12-17 18:17')

Timestamp('2002-12-17 18:17:00')

In [32]:
pd.to_datetime('2005-10-31 23:51')

Timestamp('2005-10-31 23:51:00')

In [34]:
pd.to_datetime(s, format='mixed')

0   1970-07-14 08:00:00
1   1972-03-01 10:00:00
2   2000-12-16 12:15:28
3   2002-12-17 18:17:00
4   2005-10-31 23:51:00
dtype: datetime64[ns]

In [35]:
list_of_dates = ['14-07-1970', '01-03-1971', '16-12-2000', '17-12-2002', '31-10-2005']

In [37]:
df = pd.DataFrame([x.split('-') for x in list_of_dates], columns='day month year'.split())
df

  day month  year
0  14    07  1970
1  01    03  1971
2  16    12  2000
3  17    12  2002
4  31    10  2005

In [38]:
pd.to_datetime(df[['year', 'month', 'day']])

0   1970-07-14
1   1971-03-01
2   2000-12-16
3   2002-12-17
4   2005-10-31
dtype: datetime64[ns]

In [39]:
pd.to_datetime(df[['year', 'day', 'month']])

0   1970-07-14
1   1971-03-01
2   2000-12-16
3   2002-12-17
4   2005-10-31
dtype: datetime64[ns]

### Timedelta

In [42]:
s = pd.Series(['1970-07-14 8:00', '1972-03-01 10:00 pm',
            '2000-12-16 12:15:28', '2002-12-17 18:17',
            '2005-10-31 23:51'])
s = pd.to_datetime(s, format='mixed')

In [43]:
pd.to_datetime('2021-July-01') - s

0   18614 days 16:00:00
1   18018 days 02:00:00
2    7501 days 11:44:32
3    6770 days 05:43:00
4    5721 days 00:09:00
dtype: timedelta64[ns]

In [44]:
pd.to_timedelta('2 days 3:20:10')

Timedelta('2 days 03:20:10')

In [45]:
pd.to_timedelta('2 days 3:20:10').components

Components(days=2, hours=3, minutes=20, seconds=10, milliseconds=0, microseconds=0, nanoseconds=0)